# St7GetLoadPathTemplateName

Returns the name assigned to the specified load path template.

long St7GetLoadPathTemplateName(long uID, long TemplateID, char* TemplateName,

long MaxStringLen)

Input Parameters

uID

Strand7 model file ID.

TemplateID

Load path template ID.

MaxStringLen

Maximum number of characters allocated for TemplateName.

Output Parameters
TemplateName

Name of the template.